In [1]:
30+15+55

100

In [3]:
360/100*30

108.0

In [5]:
piedict = {'a':30, 'b':15, 'c ': 55}

In [8]:
tot = 0
for key in piedict:
    tot = piedict[key] + tot
rads = 360/tot
output = {}
for key in piedict:
    output[key] = 3.6* piedict[key]
output

{'a': 108.0, 'b': 54.0, 'c ': 198.0}

In [ ]:
tf([1,2,3],1) gives [3,0,5]

In [28]:
def even_odd_transform(ls,repeat):
    i = 0
    while i < repeat:
        for item in range(len(ls)):
            if (ls[item]%2) == 1:
                ls[item] += 2
            elif (ls[item]%2) == 0:
                ls[item] -= 2
        i +=1
    return ls

In [30]:
even_odd_transform([0,0,0],10)

[-20, -20, -20]

In [31]:
import pandas as pd
import sys

ModuleNotFoundError: No module named 'supporting_files'

In [32]:
df = pd.read_excel('assessment-exam-student-python/supporting_files/SaleData.xlsx')

In [34]:
df.head()

,OrderDate,Region,Manager,SalesMan,Item,Units,Unit_price,Sale_amt
0,2018-01-06,East,Martha,Alexander,Television,95.0,1198.0,113810.0
1,2018-01-23,Central,Hermann,Shelli,Home Theater,50.0,500.0,25000.0
2,2018-02-09,Central,Hermann,Luis,Television,36.0,1198.0,43128.0
3,2018-02-26,Central,Timothy,David,Cell Phone,27.0,225.0,6075.0
4,2018-03-15,West,Timothy,Stephen,Television,56.0,1198.0,67088.0

In [55]:
tot = df[['Region', 'Manager', 'Sale_amt']].groupby(['Region', 'Manager'], as_index=False).sum().sort_values('Sale_amt', ascending = False).reset_index().drop('index', axis=1)

In [56]:
tot

    Region  Manager  Sale_amt
0  Central  Hermann  365108.5
1     East   Martha  272803.0
2  Central   Martha  199690.0
3  Central  Timothy  140955.0
4  Central  Douglas  124016.0
5     West  Timothy   88063.0
6     West  Douglas   66836.0
7     East  Douglas   48204.0

In [74]:
sale_cnt = df[['Manager','Units']].groupby('Manager', as_index=False).sum().sort_values('Units', ascending = False)

In [75]:
sale_mean = df[['Manager', 'Sale_amt']].groupby('Manager', as_index=False).mean()

In [78]:
total = sale_cnt.merge(sale_mean, how = 'inner', on = 'Manager').rename(columns = {'Units':'sale_cnt', 'Sale_amt':'sale_mean'})

In [79]:
total

   Manager  sale_cnt     sale_mean
0   Martha     704.0  33749.500000
1  Hermann     647.0  30425.708333
2  Douglas     415.0  29882.000000
3  Timothy     355.0  25446.444444

In [84]:
df['Units'].loc[df['Manager'] == 'Timothy']

3     27.0
4     56.0
22    46.0
25     7.0
29    53.0
30    80.0
35     3.0
36     7.0
37    76.0
Name: Units, dtype: float64

In [82]:
6075+67088+23000+3500+63494+40000+375+8386+17100

229018

In [85]:
27+56+46+7+53+80+3+7+76

355